## Plan Result (prod-enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 140 to add, 115 to change, 13 to destroy.</code></pre>

* Create
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_group_member.members[&#34;Azure Kubernetes Service Cluster Admin Role-0&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DCD-MI-SBOX&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].time_rotating.one_year
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_application_password.token
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_group_member.members[&#34;Contributor-0&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_group_member.members[&#34;Contributor-1&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;User Access Administrator&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].random_uuid.app_uuid
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].time_rotating.one_year
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_application_password.token
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_group.groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_group_member.members[&#34;Contributor-2&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_group_member.members[&#34;Owner-0&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_key_vault_secret.aks_admin_group_id
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_key_vault_secret.aks_user_group_id
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_key_vault_secret.sp_app_id
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_key_vault_secret.sp_object_id
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_key_vault_secret.sp_token
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_role_assignment.local_groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_role_assignment.local_groups[&#34;Security Reader&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].random_uuid.acme_app_uuid[0]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].random_uuid.app_uuid
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].time_rotating.one_year
* Update
  * module.enterprise.azurerm_management_group.level_3[&#34;SDS-NonProd&#34;]
  * module.enterprise.azurerm_management_group.level_3[&#34;SDS-Sandbox&#34;]
  * module.environment[&#34;prod&#34;].azuread_application.app
  * module.environment[&#34;ptlsbox&#34;].azuread_application.app
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_application.app
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DCD-MI-SBOX&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_application.app
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_application.app
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_application.app
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_application.app
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_application.app
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_application.app
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azurerm_subscription.this
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_application.app
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_group.groups[&#34;Key Vault Administrator&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azurerm_subscription.this
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_application.acme_appreg[0]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_application.app
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster Admin Role&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_group.groups[&#34;Azure Kubernetes Service Cluster User Role&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_group.groups[&#34;Contributor&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_group.groups[&#34;Owner&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_group.groups[&#34;Reader&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuread_group.groups[&#34;Storage Blob Data Reader&#34;]
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azuredevops_serviceendpoint_azurerm.endpoint
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_key_vault.kv
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_storage_account.sa
  * module.subscription[&#34;Reform-CFT-VH-Dev&#34;].azurerm_subscription.this
* Replace
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEMO&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-DEV&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-ITHC&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICES-TEST&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL&#34;].azuread_group_member.members[&#34;Key Vault Administrator-1&#34;]
  * module.subscription[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;].azuread_group_member.members[&#34;Key Vault Administrator-0&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.azurerm_management_group.level_3["SDS-NonProd"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/SDS-NonProd"
        name                       = "SDS-NonProd"
      ~ subscription_ids           = [
          + "3eec5bde-7feb-4566-bfb6-805df6e10b90",
          + "6c4d2513-a873-41b4-afdd-b05a33206631",
          + "705b2731-0e0b-4df7-8630-95f157f0a347",
          + "867a878b-cb68-4de5-9741-361ac9e178b6",
          + "a8140a9e-f1b0-481f-a4de-09e2ee23f7ab",
          + "ba71a911-e0d6-4776-a1a6-079af1df7139",
          + "c68a4bed-4c3d-4956-af51-4ae164c1957c",
        ]
        # (2 unchanged attributes hidden)
    }

  # module.enterprise.azurerm_management_group.level_3["SDS-Sandbox"] will be updated in-place
  ~ resource "azurerm_management_group" "level_3" {
        id                         = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox"
        name                       = "SDS-Sandbox"
      ~ subscription_ids           = [
          + "0c1744f8-9e63-4742-9c28-c066fd2e6eee",
          + "64b1c6d6-1481-44ad-b620-d8fe26a2c768",
        ]
        # (2 unchanged attributes hidden)
    }

  # module.environment["prod"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "9c149b18-7537-4b03-9093-641191faee0b"
      ~ owners                         = [
          - "6d2f8452-ba93-4a50-87a5-16e00f73af47",
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.environment["ptlsbox"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "3fdcf12a-6a2c-46fc-be16-71510f849748"
      ~ owners                         = [
          - "23b042ae-86bd-4bb1-a9c0-04a24e1b435f",
        ]
        tags                           = []
        # (14 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.subscription["DCD-MI-SBOX"].azuread_application.app will be updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "75864a3a-eee9-4091-ab3a-a90733e810ff"
      ~ oauth2_permission_scope_ids    = {
          - "user_impersonation" = "85cbabc3-6ee0-0295-8228-b3e7398f10f2"
        } -> (known after apply)
        tags                           = []
        # (14 unchanged attributes hidden)

      ~ api {
            # (3 unchanged attributes hidden)

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dcd-mi-sbox) on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access DTS Bootstrap (sub:dcd-mi-sbox)" -> null
              - enabled                    = true -> null
              - id                         = "85cbabc3-6ee0-0295-8228-b3e7398f10f2" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dcd-mi-sbox) on your behalf." -> null
              - user_consent_display_name  = "Access DTS Bootstrap (sub:dcd-mi-sbox)" -> null
              - value                      = "user_impersonation" -> null
            }
          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:dcd-mi-sbox) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Bootstrap (sub:dcd-mi-sbox)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Bootstrap (sub:dcd-mi-sbox) on your behalf."
              + user_consent_display_name  = "Access DTS Bootstrap (sub:dcd-mi-sbox)"
              + value                      = "user_impersonation"
            }
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
          + resource_access {
              + id   = "5b567255-7703-4780-807c-7be8301ae99b"
              + type = "Role"
            }
          + resource_access {
              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
              + type = "Role"
            }
        }
      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "06da0dbc-49e2-44d2-8312-53f166ab848a" -> null
              - type = "Scope" -> null
            }
        }

      ~ web {
          ~ homepage_url  = "https://dts-bootstrap-application" -> "https://dev.azure.com/hmcts/PlatformOperations"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.subscription["DCD-MI-SBOX"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = "75864a3a-eee9-4091-ab3a-a90733e810ff"
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.subscription["DCD-MI-SBOX"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster admin permissions to the DCD-MI-SBOX subscription"
      + display_name                   = "DTS AKS Administrators (sub:dcd-mi-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-MI-SBOX"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants aks cluster user permissions to the DCD-MI-SBOX subscription"
      + display_name                   = "DTS AKS Users (sub:dcd-mi-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-MI-SBOX"].azuread_group.groups["Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-MI-SBOX Subscription Contributors" -> "Grants contributor permissions to the DCD-MI-SBOX subscription"
        id                         = "07f53a0b-8055-44fa-bc2a-e03fb9e70a27"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-MI-SBOX"].azuread_group.groups["Key Vault Administrator"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants key vault administrator permissions to the DCD-MI-SBOX subscription"
      + display_name                   = "DTS Key Vault Administrators (sub:dcd-mi-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-MI-SBOX"].azuread_group.groups["Owner"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-MI-SBOX Subscription Owners" -> "Grants owner permissions to the DCD-MI-SBOX subscription"
        id                         = "41d2f7a7-1ba0-4466-9fef-9b9c8de23805"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-MI-SBOX"].azuread_group.groups["Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-MI-SBOX Subscription Readers" -> "Grants reader permissions to the DCD-MI-SBOX subscription"
        id                         = "7e128cf2-6ab5-488b-8128-634ed5ac4c18"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-MI-SBOX"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the DCD-MI-SBOX subscription"
      + display_name                   = "DTS Security Readers (sub:dcd-mi-sbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["DCD-MI-SBOX"].azuread_group.groups["Storage Blob Data Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "DCD-MI-SBOX Subscription Blob Readers" -> "Grants storage blob data contributor permissions to the DCD-MI-SBOX subscription"
        id                         = "575269a6-3c76-4f9c-98f4-b919900166a3"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-MI-SBOX"].azuread_group_member.members["Azure Kubernetes Service Cluster Admin Role-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "a6ce5b32-e0a5-419e-ba5c-67863c975941"
    }

  # module.subscription["DCD-MI-SBOX"].azuread_group_member.members["Contributor-2"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "07f53a0b-8055-44fa-bc2a-e03fb9e70a27"
      + id               = (known after apply)
      + member_object_id = "0ec60e03-4262-44ce-abcf-83e2131c9207"
    }

  # module.subscription["DCD-MI-SBOX"].azuread_group_member.members["Key Vault Administrator-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "af66f4e5-bd36-4ad9-a265-d9e7c947cbab"
    }

  # module.subscription["DCD-MI-SBOX"].azuread_group_member.members["Key Vault Administrator-1"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "95835f7c-1a61-442b-83ca-48a54fd933fb"
    }

  # module.subscription["DCD-MI-SBOX"].azuread_group_member.members["Owner-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "41d2f7a7-1ba0-4466-9fef-9b9c8de23805"
      + id               = (known after apply)
      + member_object_id = "95835f7c-1a61-442b-83ca-48a54fd933fb"
    }

  # module.subscription["DCD-MI-SBOX"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                        = "7c21b875-862b-4c6b-903f-d4bc83f5b71c"
        # (7 unchanged attributes hidden)

      + credentials {
          + serviceprincipalid  = "197e79c4-1133-4c0e-9883-9d6014fac9c6"
          + serviceprincipalkey = (sensitive value)
        }

        # (1 unchanged block hidden)
    }

  # module.subscription["DCD-MI-SBOX"].azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c0c1744f8c066fd2e6eeekv"
        name                            = "c0c1744f8c066fd2e6eeekv"
      ~ tags                            = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
            # (4 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.subscription["DCD-MI-SBOX"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c0c1744f8c066fd2e6eeekv"
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DCD-MI-SBOX"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c0c1744f8c066fd2e6eeekv"
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DCD-MI-SBOX"].azurerm_key_vault_secret.sp_app_id will be created
  + resource "azurerm_key_vault_secret" "sp_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c0c1744f8c066fd2e6eeekv"
      + name                    = "sp-application-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DCD-MI-SBOX"].azurerm_key_vault_secret.sp_object_id will be created
  + resource "azurerm_key_vault_secret" "sp_object_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-sbox-rg/providers/Microsoft.KeyVault/vaults/c0c1744f8c066fd2e6eeekv"
      + name                    = "sp-object-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["DCD-MI-SBOX"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a0

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

e updated in-place
  ~ resource "azuread_application" "app" {
        id                             = "c17e7151-6d52-4cda-8110-fa3a954306bb"
      ~ oauth2_permission_scope_ids    = {
          - "user_impersonation" = "daf057f5-339e-476e-b986-b2ed8bd3bf94"
        } -> (known after apply)
        tags                           = []
        # (14 unchanged attributes hidden)

      ~ api {
            # (3 unchanged attributes hidden)

          - oauth2_permission_scope {
              - admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:reform-cft-vh-dev) on behalf of the signed-in user." -> null
              - admin_consent_display_name = "Access DTS Bootstrap (sub:reform-cft-vh-dev)" -> null
              - enabled                    = true -> null
              - id                         = "daf057f5-339e-476e-b986-b2ed8bd3bf94" -> null
              - type                       = "User" -> null
              - user_consent_description   = "Allow the application to access DTS Bootstrap (sub:reform-cft-vh-dev) on your behalf." -> null
              - user_consent_display_name  = "Access DTS Bootstrap (sub:reform-cft-vh-dev)" -> null
              - value                      = "user_impersonation" -> null
            }
          + oauth2_permission_scope {
              + admin_consent_description  = "Allow the application to access DTS Bootstrap (sub:reform-cft-vh-dev) on behalf of the signed-in user."
              + admin_consent_display_name = "Access DTS Bootstrap (sub:reform-cft-vh-dev)"
              + enabled                    = true
              + id                         = (known after apply)
              + type                       = "User"
              + user_consent_description   = "Allow the application to access DTS Bootstrap (sub:reform-cft-vh-dev) on your behalf."
              + user_consent_display_name  = "Access DTS Bootstrap (sub:reform-cft-vh-dev)"
              + value                      = "user_impersonation"
            }
        }

      + required_resource_access {
          + resource_app_id = "00000003-0000-0000-c000-000000000000"

          + resource_access {
              + id   = "06da0dbc-49e2-44d2-8312-53f166ab848a"
              + type = "Scope"
            }
          + resource_access {
              + id   = "5b567255-7703-4780-807c-7be8301ae99b"
              + type = "Role"
            }
          + resource_access {
              + id   = "9a5d68dd-52b0-4cc2-bd40-abcf44ac3a30"
              + type = "Role"
            }
        }
      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "06da0dbc-49e2-44d2-8312-53f166ab848a" -> null
              - type = "Scope" -> null
            }
        }

      ~ web {
          ~ homepage_url  = "https://dts-bootstrap-application" -> "https://dev.azure.com/hmcts/PlatformOperations"
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuread_application_password.token will be created
  + resource "azuread_application_password" "token" {
      + application_object_id = "c17e7151-6d52-4cda-8110-fa3a954306bb"
      + display_name          = (known after apply)
      + end_date              = (known after apply)
      + id                    = (known after apply)
      + key_id                = (known after apply)
      + rotate_when_changed   = (known after apply)
      + start_date            = (known after apply)
      + value                 = (sensitive value)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuread_group.groups["Azure Kubernetes Service Cluster Admin Role"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "REFORM-CFT-VH-DEV AKS Administrators" -> "Grants aks cluster admin permissions to the Reform-CFT-VH-Dev subscription"
        id                         = "d70bfea8-830b-4649-85db-754d96280273"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuread_group.groups["Azure Kubernetes Service Cluster User Role"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "REFORM-CFT-VH-DEV AKS Users" -> "Grants aks cluster user permissions to the Reform-CFT-VH-Dev subscription"
        id                         = "52eef9e1-c48e-482f-8b43-c9628fb06590"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuread_group.groups["Contributor"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "REFORM-CFT-VH-DEV Subscription Contributors" -> "Grants contributor permissions to the Reform-CFT-VH-Dev subscription"
        id                         = "426d48dc-2cac-439f-a3ea-1f8acf3f49e7"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuread_group.groups["Key Vault Administrator"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants key vault administrator permissions to the Reform-CFT-VH-Dev subscription"
      + display_name                   = "DTS Key Vault Administrators (sub:reform-cft-vh-dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuread_group.groups["Owner"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "REFORM-CFT-VH-DEV Subscription Owners" -> "Grants owner permissions to the Reform-CFT-VH-Dev subscription"
        id                         = "5e725fcb-6925-436b-8d7c-e609bb5c3fcd"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuread_group.groups["Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "REFORM-CFT-VH-DEV Subscription Readers" -> "Grants reader permissions to the Reform-CFT-VH-Dev subscription"
        id                         = "94d21afe-5d3d-41a9-8262-067241c81d9d"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuread_group.groups["Security Reader"] will be created
  + resource "azuread_group" "groups" {
      + auto_subscribe_new_members     = (known after apply)
      + description                    = "Grants security reader permissions to the Reform-CFT-VH-Dev subscription"
      + display_name                   = "DTS Security Readers (sub:reform-cft-vh-dev)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuread_group.groups["Storage Blob Data Reader"] will be updated in-place
  ~ resource "azuread_group" "groups" {
      ~ description                = "REFORM-CFT-VH-DEV Subscription Blob Readers" -> "Grants storage blob data contributor permissions to the Reform-CFT-VH-Dev subscription"
        id                         = "657e90b0-6188-4bef-b961-dd19b82928ad"
      ~ prevent_duplicate_names    = false -> true
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuread_group_member.members["Contributor-2"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "426d48dc-2cac-439f-a3ea-1f8acf3f49e7"
      + id               = (known after apply)
      + member_object_id = "0ec60e03-4262-44ce-abcf-83e2131c9207"
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuread_group_member.members["Key Vault Administrator-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "11743ca2-05f1-48f9-a28a-e62f3075ddc4"
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuread_group_member.members["Key Vault Administrator-1"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = (known after apply)
      + id               = (known after apply)
      + member_object_id = "94c5c7b6-0fe8-4a0a-9903-c36beea533f8"
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuread_group_member.members["Owner-0"] will be created
  + resource "azuread_group_member" "members" {
      + group_object_id  = "5e725fcb-6925-436b-8d7c-e609bb5c3fcd"
      + id               = (known after apply)
      + member_object_id = "94c5c7b6-0fe8-4a0a-9903-c36beea533f8"
    }

  # module.subscription["Reform-CFT-VH-Dev"].azuredevops_serviceendpoint_azurerm.endpoint will be updated in-place
  ~ resource "azuredevops_serviceendpoint_azurerm" "endpoint" {
        id                        = "a6737210-c664-4f52-a6d9-1db12112e05d"
        # (7 unchanged attributes hidden)

      + credentials {
          + serviceprincipalid  = "1efc21fa-9e40-4bd7-9715-0db94c4191af"
          + serviceprincipalkey = (sensitive value)
        }

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c705b273195f157f0a347kv"
        name                            = "c705b273195f157f0a347kv"
      ~ tags                            = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
          ~ "businessArea" = "CFT" -> "Cross-Cutting"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_key_vault_secret.aks_admin_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_admin_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c705b273195f157f0a347kv"
      + name                    = "aks-admin-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_key_vault_secret.aks_user_group_id will be created
  + resource "azurerm_key_vault_secret" "aks_user_group_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c705b273195f157f0a347kv"
      + name                    = "aks-user-rbac-group-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_key_vault_secret.sp_app_id will be created
  + resource "azurerm_key_vault_secret" "sp_app_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c705b273195f157f0a347kv"
      + name                    = "sp-application-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_key_vault_secret.sp_object_id will be created
  + resource "azurerm_key_vault_secret" "sp_object_id" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c705b273195f157f0a347kv"
      + name                    = "sp-object-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_key_vault_secret.sp_token will be created
  + resource "azurerm_key_vault_secret" "sp_token" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.KeyVault/vaults/c705b273195f157f0a347kv"
      + name                    = "sp-token"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_role_assignment.local_groups["Key Vault Administrator"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_role_assignment.local_groups["Security Reader"] will be created
  + resource "azurerm_role_assignment" "local_groups" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Security Reader"
      + scope                            = "/subscriptions/705b2731-0e0b-4df7-8630-95f157f0a347"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_storage_account.sa will be updated in-place
  ~ resource "azurerm_storage_account" "sa" {
      + cross_tenant_replication_enabled  = true
        id                                = "/subscriptions/04d27a32-7a07-48b3-95b8-3c8691e1a263/resourceGroups/azure-control-dev-rg/providers/Microsoft.Storage/storageAccounts/c705b273195f157f0a347sa"
      ~ min_tls_version                   = "TLS1_0" -> "TLS1_2"
        name                              = "c705b273195f157f0a347sa"
      ~ tags                              = {
          ~ "builtFrom"    = "hmcts/ops-bootstrap" -> "hmcts/azure-enterprise"
          ~ "businessArea" = "CFT" -> "Cross-Cutting"
            # (3 unchanged elements hidden)
        }
        # (34 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.subscription["Reform-CFT-VH-Dev"].azurerm_subscription.this will be updated in-place
  ~ resource "azurerm_subscription" "this" {
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/59232335/enrollmentAccounts/233705"
        id                = "/providers/Microsoft.Subscription/aliases/Reform-CFT-VH-Dev"
        tags              = {}
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.subscription["Reform-CFT-VH-Dev"].random_uuid.acme_app_uuid[0] will be created
  + resource "random_uuid" "acme_app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].random_uuid.app_uuid will be created
  + resource "random_uuid" "app_uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.subscription["Reform-CFT-VH-Dev"].time_rotating.one_year will be created
  + resource "time_rotating" "one_year" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 365
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

Plan: 140 to add, 115 to change, 13 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":43,"Program":"tfcmt","SHA1":"","Target":"prod-enterprise","Vars":{}} -->